<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class ProductSmartController extends Controller
{

    public function LensProductGroup(){
        return [
            ['sph' => ['0', '+1'], 'cyl' => '0'],
            ['sph' => ['0', '-1'], 'cyl' => '0'],
            ['sph' => ['0', '-1'], 'cyl' => '- 0.75'],
            ['sph' => ['0', '-1'], 'cyl' => '- 1.25'],
            ['sph' => ['0', '-1'], 'cyl' => '- 1.75'],
            ['sph' => ['0', '-1'], 'cyl' => '- 2.25'],
            ['sph' => ['0', '-1'], 'cyl' => '- 2.75'],
            ['sph' => ['0', '-1'], 'cyl' => '- 3.25'],
            ['sph' => ['0', '-1'], 'cyl' => '- 3.75'],
            ['sph' => ['0', '-1'], 'cyl' => '- 4.25'],

            ['sph' => ['+1', '+2'], 'cyl' => '0'],
            ['sph' => ['-1', '-2'], 'cyl' => '0'],
            ['sph' => ['-1', '-2'], 'cyl' => '- 0.75'],
            ['sph' => ['-1', '-2'], 'cyl' => '- 1.25'],
            ['sph' => ['-1', '-2'], 'cyl' => '- 1.75'],
            ['sph' => ['-1', '-2'], 'cyl' => '- 2.25'],
            ['sph' => ['-1', '-2'], 'cyl' => '- 2.75'],
            ['sph' => ['-1', '-2'], 'cyl' => '- 3.25'],
            ['sph' => ['-1', '-2'], 'cyl' => '- 3.75'],
            ['sph' => ['-1', '-2'], 'cyl' => '- 4.25'],

            ['sph' => ['+2', '+3'], 'cyl' => '0'],
            ['sph' => ['-2', '-3'], 'cyl' => '0'],
            ['sph' => ['-2', '-3'], 'cyl' => '- 0.75'],
            ['sph' => ['-2', '-3'], 'cyl' => '- 1.25'],
            ['sph' => ['-2', '-3'], 'cyl' => '- 1.75'],
            ['sph' => ['-2', '-3'], 'cyl' => '- 2.25'],
            ['sph' => ['-2', '-3'], 'cyl' => '- 2.75'],
            ['sph' => ['-2', '-3'], 'cyl' => '- 3.25'],
            ['sph' => ['-2', '-3'], 'cyl' => '- 3.75'],
            ['sph' => ['-2', '-3'], 'cyl' => '- 4.25'],

            ['sph' => ['+3', '+4'], 'cyl' => '0'],
            ['sph' => ['-3', '-4'], 'cyl' => '0'],
            ['sph' => ['-3', '-4'], 'cyl' => '- 0.75'],
            ['sph' => ['-3', '-4'], 'cyl' => '- 1.25'],
            ['sph' => ['-3', '-4'], 'cyl' => '- 1.75'],
            ['sph' => ['-3', '-4'], 'cyl' => '- 2.25'],
            ['sph' => ['-3', '-4'], 'cyl' => '- 2.75'],
            ['sph' => ['-3', '-4'], 'cyl' => '- 3.25'],
            ['sph' => ['-3', '-4'], 'cyl' => '- 3.75'],
            ['sph' => ['-3', '-4'], 'cyl' => '- 4.25'],

            ['sph' => ['+4', '+5'], 'cyl' => '0'],
            ['sph' => ['-4', '-5'], 'cyl' => '0'],
            ['sph' => ['-4', '-5'], 'cyl' => '- 0.75'],
            ['sph' => ['-4', '-5'], 'cyl' => '- 1.25'],
            ['sph' => ['-4', '-5'], 'cyl' => '- 1.75'],
            ['sph' => ['-4', '-5'], 'cyl' => '- 2.25'],
            ['sph' => ['-4', '-5'], 'cyl' => '- 2.75'],
            ['sph' => ['-4', '-5'], 'cyl' => '- 3.25'],
            ['sph' => ['-4', '-5'], 'cyl' => '- 3.75'],
            ['sph' => ['-4', '-5'], 'cyl' => '- 4.25'],

            ['sph' => ['+5', '+6'], 'cyl' => '0'],
            ['sph' => ['-5', '-6'], 'cyl' => '0'],
            ['sph' => ['-5', '-6'], 'cyl' => '- 0.75'],
            ['sph' => ['-5', '-6'], 'cyl' => '- 1.25'],
            ['sph' => ['-5', '-6'], 'cyl' => '- 1.75'],
            ['sph' => ['-5', '-6'], 'cyl' => '- 2.25'],
            ['sph' => ['-5', '-6'], 'cyl' => '- 2.75'],
            ['sph' => ['-5', '-6'], 'cyl' => '- 3.25'],
            ['sph' => ['-5', '-6'], 'cyl' => '- 3.75'],
            ['sph' => ['-5', '-6'], 'cyl' => '- 4.25'],

            ['sph' => ['+6', '+7'], 'cyl' => '0'],
            ['sph' => ['-6', '-7'], 'cyl' => '0'],
            ['sph' => ['-6', '-7'], 'cyl' => '- 0.75'],
            ['sph' => ['-6', '-7'], 'cyl' => '- 1.25'],
            ['sph' => ['-6', '-7'], 'cyl' => '- 1.75'],
            ['sph' => ['-6', '-7'], 'cyl' => '- 2.25'],
            ['sph' => ['-6', '-7'], 'cyl' => '- 2.75'],
            ['sph' => ['-6', '-7'], 'cyl' => '- 3.25'],
            ['sph' => ['-6', '-7'], 'cyl' => '- 3.75'],
            ['sph' => ['-6', '-7'], 'cyl' => '- 4.25'],

            ['sph' => ['+7', '+8'], 'cyl' => '0'],
            ['sph' => ['-7', '-8'], 'cyl' => '0'],
            ['sph' => ['-7', '-8'], 'cyl' => '- 0.75'],
            ['sph' => ['-7', '-8'], 'cyl' => '- 1.25'],
            ['sph' => ['-7', '-8'], 'cyl' => '- 1.75'],
            ['sph' => ['-7', '-8'], 'cyl' => '- 2.25'],
            ['sph' => ['-7', '-8'], 'cyl' => '- 2.75'],
            ['sph' => ['-7', '-8'], 'cyl' => '- 3.25'],
            ['sph' => ['-7', '-8'], 'cyl' => '- 3.75'],
            ['sph' => ['-7', '-8'], 'cyl' => '- 4.25'],

            ['sph' => ['+8', '+9'], 'cyl' => '0'],
            ['sph' => ['-8', '-9'], 'cyl' => '0'],
            ['sph' => ['-8', '-9'], 'cyl' => '- 0.75'],
            ['sph' => ['-8', '-9'], 'cyl' => '- 1.25'],
            ['sph' => ['-8', '-9'], 'cyl' => '- 1.75'],
            ['sph' => ['-8', '-9'], 'cyl' => '- 2.25'],
            ['sph' => ['-8', '-9'], 'cyl' => '- 2.75'],
            ['sph' => ['-8', '-9'], 'cyl' => '- 3.25'],
            ['sph' => ['-8', '-9'], 'cyl' => '- 3.75'],
            ['sph' => ['-8', '-9'], 'cyl' => '- 4.25'],

            ['sph' => ['+9', '+10'], 'cyl' => '0'],
            ['sph' => ['-9', '-10'], 'cyl' => '0'],
            ['sph' => ['-9', '-10'], 'cyl' => '- 0.75'],
            ['sph' => ['-9', '-10'], 'cyl' => '- 1.25'],
            ['sph' => ['-9', '-10'], 'cyl' => '- 1.75'],
            ['sph' => ['-9', '-10'], 'cyl' => '- 2.25'],
            ['sph' => ['-9', '-10'], 'cyl' => '- 2.75'],
            ['sph' => ['-9', '-10'], 'cyl' => '- 3.25'],
            ['sph' => ['-9', '-10'], 'cyl' => '- 3.75'],
            ['sph' => ['-9', '-10'], 'cyl' => '- 4.25'],
        ];
    }
    public function LensProductGroupSph(){
        return ['-1', '-2', '-3', '-4', '-5', '-6', '-7', '-8', '-9', '-10', '+1', '+2', '+3', '+4', '+5', '+6', '+7', '+8', '+9', '+10'];
    }
    public function LensProductGroupCyl(){
        return ['0.75', '1.25', '1.75', '2.25', '2.75', '3.25', '3.75', '4.25'];
    }

    public function LensProductDiagonals(){
        return ['13.5', '13.6', '13.7', '13.8', '13.9', '14.0', '14.1', '14.2', '14.3', '14.4', '14.5'];
    }

    public function LensProductCurvatures(){
        return ['8.4', '8.5', '8.6', '8.7', '8.8', '8.9'];
    }

    public function LensProductNumber(){
        return ['1', '2', '3', '4', '5', '6'];
    }

    public function LensProductColor(){
        return ['بی رنگ', 'طوسی', 'عسلی', 'آبی', 'سبز'];
    }

    public function LensProductConsumptionPeriod(){
        return ['یک بار مصرف', 'شب و روز', 'یکماهه', 'فصلی', 'سالانه'];
    }

    public function LensProductStructures(){
        return ['لنز نرم رنگی طبی', 'لنز آستیگمات (توریک)', 'لنر رنگی پلانو', 'لنر بدونه رنگ طبی', 'لنز سیلیکون هایدروژلی', 'لنز هارد'];
    }

    public function LensProductAstigmatisms(){
        return ['ندارد', '10', '20', '30', '40', '50', '60', '70', '80', '90', '100', '110', '120', '130', '140', '150', '160', '170', '180'];
    }

    public function OpticalGlassProductGroup(){
        return [
            ['sph' => ['-2', '']],
            ['sph' => ['+2', '']],
            ['sph' => ['-2', '-2']],
            ['sph' => ['+2', '+2']],
            ['sph' => ['+2', '-2']],
            ['sph' => ['-2', '-4']],
            ['sph' => ['+2', '+4']],
            ['sph' => ['+2', '-4']],
            ['sph' => ['-2', '-6']],
            ['sph' => ['+2', '+6']],
            ['sph' => ['+2', '-6']],

            ['sph' => ['-4', '']],
            ['sph' => ['+4', '']],
            ['sph' => ['-4', '-2']],
            ['sph' => ['+4', '+2']],
            ['sph' => ['+4', '-2']],
            ['sph' => ['-4', '-4']],
            ['sph' => ['+4', '-4']],
            ['sph' => ['+4', '+4']],
            ['sph' => ['-4', '-6']],
            ['sph' => ['+4', '-6']],
            ['sph' => ['+4', '+6']],

            ['sph' => ['-6', '']],
            ['sph' => ['+6', '']],
            ['sph' => ['-6', '-2']],
            ['sph' => ['+6', '+2']],
            ['sph' => ['+6', '-2']],
            ['sph' => ['-6', '-4']],
            ['sph' => ['+6', '-4']],
            ['sph' => ['+6', '+4']],
            ['sph' => ['-6', '-6']],
            ['sph' => ['+6', '-6']],
            ['sph' => ['+6', '+6']],

            ['sph' => ['-8', '']],
            ['sph' => ['+8', '']],
            ['sph' => ['-8', '-2']],
            ['sph' => ['+8', '+2']],
            ['sph' => ['+8', '-2']],
            ['sph' => ['-8', '-4']],
            ['sph' => ['+8', '-4']],
            ['sph' => ['+8', '+4']],
            ['sph' => ['-8', '-6']],
            ['sph' => ['+8', '-6']],
            ['sph' => ['+8', '+6']],

            ['sph' => ['-10', '']],
            ['sph' => ['+10', '']],
            ['sph' => ['-10', '-2']],
            ['sph' => ['+10', '+2']],
            ['sph' => ['+10', '-2']],
            ['sph' => ['-10', '-4']],
            ['sph' => ['+10', '-4']],
            ['sph' => ['+10', '+4']],
            ['sph' => ['-10', '-6']],
            ['sph' => ['+10', '-6']],
            ['sph' => ['+10', '+6']],

            ['sph' => ['-12', '']],
            ['sph' => ['+12', '']],
            ['sph' => ['-12', '-2']],
            ['sph' => ['+12', '+2']],
            ['sph' => ['+12', '-2']],
            ['sph' => ['-12', '-4']],
            ['sph' => ['+12', '-4']],
            ['sph' => ['+12', '+4']],
            ['sph' => ['-12', '-6']],
            ['sph' => ['+12', '-6']],
            ['sph' => ['+12', '+6']],

            ['sph' => ['-14', '']],
            ['sph' => ['+14', '']],
            ['sph' => ['-14', '-2']],
            ['sph' => ['+14', '+2']],
            ['sph' => ['+14', '-2']],
            ['sph' => ['-14', '-4']],
            ['sph' => ['+14', '-4']],
            ['sph' => ['+14', '+4']],
            ['sph' => ['-14', '-6']],
            ['sph' => ['+14', '-6']],
            ['sph' => ['+14', '+6']],

            ['sph' => ['-16', '']],
            ['sph' => ['+16', '']],
            ['sph' => ['-16', '-2']],
            ['sph' => ['+16', '+2']],
            ['sph' => ['+16', '-2']],
            ['sph' => ['-16', '-4']],
            ['sph' => ['+16', '-4']],
            ['sph' => ['+16', '+4']],
            ['sph' => ['-16', '-6']],
            ['sph' => ['+16', '-6']],
            ['sph' => ['+16', '+6']],

            ['sph' => ['-18', '']],
            ['sph' => ['+18', '']],
            ['sph' => ['-18', '-2']],
            ['sph' => ['+18', '+2']],
            ['sph' => ['+18', '-2']],
            ['sph' => ['-18', '-4']],
            ['sph' => ['+18', '-4']],
            ['sph' => ['+18', '+4']],
            ['sph' => ['-18', '-6']],
            ['sph' => ['+18', '-6']],
            ['sph' => ['+18', '+6']],


        ];
    }
    public function OpticalGlassProductGroupSph(){
        return ['2', '4', '6', '8', '10', '12', '14', '16', '18'];
    }
    public function OpticalGlassProductGroupCyl(){
        return ['2', '4', '6'];
    }

    public function OpticalGlassProductLightBreakdown(){
        return ['1.5', '1.53', '1.54', '1.55', '1.56', '1.57', '1.58', '1.59', '1.6', '1.61', '1.67', '1.74'];
    }

    public function OpticalGlassProductSize(){
        return ['55', '65', '70', '72', '75'];
    }

    public function OpticalGlassProductAntiReflexColors(){
        return [ 'بدون آنتی رفلکس','طلایی', 'بنفش', 'آبی', 'سبز'];
    }

    public function OpticalGlassProductBlocks(){
        return [ 'دارد', 'ندارد'];
    }

    public function OpticalGlassProductBlocTrolls(){
        return [ 'دارد', 'ندارد'];
    }

    public function OpticalGlassProductPolycarbonates(){
        return [ 'دارد', 'ندارد'];
    }

    public function OpticalGlassProductPolybreaks(){
        return [ 'دارد', 'ندارد'];
    }

    public function OpticalGlassProductColorWhites(){
        return [ 'دارد', 'ندارد'];
    }

    public function OpticalGlassProductColored_scores(){
        return [ 'دارد', 'ندارد'];
    }

    public function OpticalGlassProductWaterings(){
        return [ 'هایدروفوبیک', 'سوپر هایدروفوبیک', 'هیچکدام'];
    }

    public function OpticalGlassProductPhotocrophys(){
        return [ 'دارد', 'ندارد', 'ترانزیشن'];
    }

    public function OpticalGlassProductPhoto_colors(){
        return [ 'قهوه ای', 'مشکی', 'ندارد'];
    }


    public function OpticalGlassProductStructures(){
        return [ 'اسفریک', 'آسفریک', 'دبل آسفریک', 'هیچکدام'];
    }


    public function OpticalGlassProductYuVies(){
        return [ '0', '385', '400', '420'];
    }

    public function OpticalGlassProductProperties(){
        return [ 'پلاستیک آنتی رفلکس', 'پلاستیک سفید', 'پلی کربنات', 'فوتو کرومیک پلی کربنات', 'نشکن ترایوکس', 'فوتو کرومیک', 'پلاریزه', 'organic', 'proton', 'transitions', 'transitions proton', 'transitions trivex', 'خام'];
    }

    public function OpticalGlassProductTypes(){
        return [ 'stock' => 'Stock تک دید', 'rx_1' => 'RX تک دید', 'rx_2' => 'Rx دو دید (bifocal)', 'rx_3' => 'RX تدریجی (progressive)'];
    }


    public function SearchSph(){
        return ['0', '-0.25', '-0.50', '-0.75', '-1', '-1.25', '-1.50', '-1.75', '-2', '-2.25', '-2.50', '-2.75', '-3', '-3.25', '-3.50', '-3.75', '-4', '-4.25', '-4.50', '-4.75', '-5', '-5.25', '-5.50', '-5.75', '-6', '-6.25', '-6.50', '-6.75', '-7', '-7.25', '-7.50', '-7.75', '-8', '-8.25', '-8.50', '-8.75', '-9', '-9.25', '-9.50', '-9.75'];
    }

    public function SearchSphOptic(){
        $array = ['0'];
        for ($i = 0.25; $i <= 17.75 ; $i += 0.25){
            $number = number_format((float)$i, 2, '.', '');
            $array[] = '-' . $number;
        }
        for ($i = 0.25; $i <= 17.75 ; $i += 0.25){
            $number = number_format((float)$i, 2, '.', '');
            $array[] = '+' . $number;
        }
        return $array;
    }

    public function SearchCyl(){
        return [
            '0',
            '-0.75',
            '-1.25',
            '-1.75',
            '-2.25',
            '-2.75',
            '-3.25',
            '-3.75',
            '-4.25',
        ];
    }

    public function SearchCylOptic(){
        $array = ['0'];
        for ($i = 0.25; $i <= 5.75 ; $i += 0.25){
            $number = number_format((float)$i, 2, '.', '');
            $array[] = '-' . $number;
        }
        for ($i = 0.25; $i <= 5.75 ; $i += 0.25){
            $number = number_format((float)$i, 2, '.', '');
            $array[] = '+' . $number;
        }
        return $array;
    }

    public function SearchAxis(){
        $array = ['0 = 180'];
        for ($i = 10; $i <= 180 ; $i += 10){
            $array[] = $i;
        }
        return $array;
    }

    public function SearchAxisOptic(){
        $array = ['0 = 180'];
        for ($i = 1; $i <= 179 ; $i++){
            $array[] = $i;
        }
        return $array;
    }

    public function SearchAddOptic(){
        $array = ['بدون محدودیت'];
        for ($i = 0.25; $i <= 10 ; $i += 0.25){
            $number = number_format((float)$i, 2, '.', '');
            $array[] = '+' . $number;
        }
        return $array;
    }

    public function SearchPd(){
        for ($i = 22; $i <= 42 ; $i += 0.5){
            $array[] = $i;
        }
        return $array;
    }

}
